fix flowchart to README
